app/controllers/pages_controller.rb

INSERT INTO "assignments" ("visitor_token", "variant", "created_at", "updated_at") VALUES ('8630e64f0e27ce33', 'control', '2026-05-16 11:26:50.766533', '2026-05-16 11:26:50.766533') RETURNING "id"
---
  def landing
    @courses = COURSES

    if session[:converted]
      @cta = "Continue Learning"
    else
      token = session[:visitor_token]
      assignment = Assignment.find_by(visitor_token: token) if token

      if assignment.nil?
        token = SecureRandom.hex(8)
        variant = VARIANTS.keys.sample
        assignment = Assignment.create(visitor_token: token, variant: variant)

SELECT "assignments".* FROM "assignments" WHERE "assignments"."visitor_token" = '8630e64f0e27ce33' LIMIT 1
INSERT INTO "conversions" ("assignment_id", "created_at", "updated_at") VALUES (2, '2026-05-16 11:27:47.089220', '2026-05-16 11:27:47.089220') RETURNING "id"
---
  def signup_submit
    token = session[:visitor_token]
    assignment = Assignment.find_by(visitor_token: token) if token

    if assignment && !assignment.conversion
      Conversion.create(assignment: assignment)